aluiziotomazelli/smart-farm/app_water_tank/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_TWO_OTA=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

CONFIG_WATER_TANK_ENABLE=y


CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_UNICORE=y
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN_752=y
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y
CONFIG_PM_ENABLE=y

